shell-utils.org
#+TITLE:     Shell utilities
#+AUTHOR:    Fabrice Niessen
#+EMAIL:     (concat "fniessen" at-sign "pirilampo.org")
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en

#+PROPERTY:  header-args :eval no
#+SETUPFILE: theme-bigblow-pirilampo.setup

#+name: current-time
#+begin_src emacs-lisp :eval yes :results value silent :tangle no
(format-time-string "%Y%m%d.%H%M")
#+end_src

* Context

https://explainshell.com/explain?cmd=find%20.%20-type%20f%20-iname%20%22*.m%22%20-exec%20rgrep.1%20-i%20%22Content%22%20%7B%7D%20%2B

** Description

The shell utilities are core shell functions and scripts which I wrote when
doing my day-to-day tasks.  Over time, this will become a *powerful toolkit*.

#+begin_note
Library of Babel needs the ~#+name~ field to "ingest" a code block -- for Org mode
users.
#+end_note

** See also

For similar collections, see:

- http://icodesnippet.com/
- http://exploitsdownload.com/
- http://code.google.com/
- [[https://bbs.archlinux.org/viewtopic.php?id=56646&p=1][Post your handy self made command line utilities]]

** Coding style

- http://wiki.bash-hackers.org/scripting/style

- https://google-styleguide.googlecode.com/svn/trunk/shell.xml

  ~variable_name~ (preferred, ~variableName~ accepted) \\
  ~function_name~ \\
  ~CONSTANT_NAME~

** Shell formatter + checker

- https://github.com/mvdan/sh
- https://google.github.io/styleguide/shell.xml
- https://www.shellcheck.net/ (online checker!)

http://www.skybert.net/emacs/bash-linting-in-emacs/

** Prerequisites

- Clear
- Diff
- Iconv

* Core utilities

** Reverse the order of lines in a file

tac (the, ahem, reverse of cat). Part of coreutils.

Flipping one file into another

#+begin_src shell
tac a.txt > b.txt
#+end_src

** Difference between two directories

#+begin_src shell
colordiff -urb dir1 dir2
colordiff -qr dir1 dir2 | sort
#+end_src

Options explained:
- -q :: Output only whether files differ!
- -u :: Output NUM (default 3) lines of unified context.
- -r :: Recursively compare any subdirectories found.
- -b :: Ignore white space changes.

* Shell aliases

XXX Do they need to be added to =~/.bash_aliases=?

** Remove duplicate lines without sorting

How to *delete duplicate lines* in a file *without sorting* it?

: awk '!seen[$0]++' file.txt

https://stackoverflow.com/questions/1444406/how-to-delete-duplicate-lines-in-a-file-without-sorting-it-in-unix

** Find all of the distinct file extensions in a folder hierarchy

Find executable file extensions:

: find . -executable -type f | awk -F'.' '{print $NF;}'

Recursive version:

#+begin_src shell
alias file_ext=$'find . -type f -name "*.*" | awk -F. \'!a[$NF]++{print $NF}\''
#+end_src

Recursive version:

#+begin_src shell
find . -type f | sed -e 's/.*\.//' | sed -e 's/.*\///' | sort -u
#+end_src

If you want totals (how may times the extension was seen):

#+begin_src shell
find . -type f | sed -e 's/.*\.//' | sed -e 's/.*\///' | sort | uniq -c | sort -rn
#+end_src

Non-recursive (single folder):

#+begin_src shell
for f in *.*; do printf "%s\n" "${f##*.}"; done | sort -u
#+end_src

* Shell functions
:PROPERTIES:
:header-args+: :tangle ~/.dotfiles/bin/shellutils :shebang #!/usr/bin/env bash
:END:

Only use alphanumeric characters and the underscore for function names.

