shell-utils.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shell utilities</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Fabrice Niessen" />
</head>
<body>
<div id="content">
<h1 class="title">Shell utilities</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org53b1121">1. Context</a>
<ul>
<li><a href="#org49ccb81">1.1. Description</a></li>
<li><a href="#org97b307c">1.2. See also</a></li>
<li><a href="#orgbc7be9f">1.3. Coding style</a></li>
<li><a href="#org315c7c5">1.4. Shell formatter + checker</a></li>
<li><a href="#org5d4d9b5">1.5. Prerequisites</a></li>
</ul>
</li>
<li><a href="#org53cac74">2. Core utilities</a>
<ul>
<li><a href="#orgaf452bf">2.1. Reverse the order of lines in a file</a></li>
<li><a href="#org1b07038">2.2. Difference between two directories</a></li>
</ul>
</li>
<li><a href="#org2e87723">3. Shell aliases</a>
<ul>
<li><a href="#org2e766ba">3.1. Remove duplicate lines without sorting</a></li>
<li><a href="#org9674cff">3.2. Find all of the distinct file extensions in a folder hierarchy</a></li>
</ul>
</li>
<li><a href="#orgb9428e5">4. Shell functions</a>
<ul>
<li><a href="#org878c9d8">4.1. Exit with an error</a></li>
<li><a href="#org215bb08">4.2. Check for executable files</a></li>
<li><a href="#orgacdcca3">4.3. Check for Cygwin executable files</a></li>
<li><a href="#orgeb53d1a">4.4. Find the name of the parent process</a></li>
<li><a href="#org99ebd20">4.5. Find files</a></li>
<li><a href="#org217a552">4.6. Find recent files</a></li>
<li><a href="#orgb7970ea">4.7. Find recent files</a></li>
</ul>
</li>
<li><a href="#org608c48d">5. Shell scripts</a>
<ul>
<li><a href="#org04ac764">5.1. Send an email</a>
<ul>
<li><a href="#org8732803">5.1.1. Name</a></li>
<li><a href="#org5395f99">5.1.2. Synopsis</a></li>
<li><a href="#org0db8960">5.1.3. Description</a></li>
<li><a href="#org2f01205">5.1.4. Options</a></li>
<li><a href="#org9814b8b">5.1.5. Stdin</a></li>
<li><a href="#orgbb9a03c">5.1.6. Input files</a></li>
<li><a href="#orga97f0b2">5.1.7. Environment variables</a></li>
<li><a href="#org9c562fa">5.1.8. Stdout</a></li>
<li><a href="#orgbfe9568">5.1.9. Stderr</a></li>
<li><a href="#org8d32b1b">5.1.10. Output files</a></li>
<li><a href="#org780a577">5.1.11. Exit status</a></li>
<li><a href="#org4e7d223">5.1.12. Examples</a></li>
<li><a href="#orga0d9ed9">5.1.13. Code</a></li>
</ul>
</li>
<li><a href="#org8b0cb41">5.2. Echo text in color</a></li>
<li><a href="#org3595ef0">5.3. Find duplicates</a>
<ul>
<li><a href="#org8cb6378">5.3.1. finddup &#x2013; Find DUPlicate files</a></li>
<li><a href="#orgddc82d8">5.3.2. dupe &#x2013; Search for duplicated filenames</a></li>
<li><a href="#org08ec754">5.3.3. grep2 &#x2013; Find all AXVW files with two strings (Show AXVW files with both matches only)</a></li>
</ul>
</li>
<li><a href="#org06a1854">5.4. Utils</a></li>
</ul>
</li>
<li><a href="#org77c8769">6. Findup</a></li>
<li><a href="#org6f438b1">7. Compare two files and print unmatched lines / Deleting lines from one file which are in another file</a>
<ul>
<li><a href="#org5ff1aa4">7.1. Comm</a></li>
<li><a href="#orgd3fed63">7.2. AWK</a></li>
<li><a href="#org6adf987">7.3. Diff</a></li>
</ul>
</li>
<li><a href="#orga9b9966">8. Recursively run chmod -x?</a>
<ul>
<li><a href="#org0c2ec29">8.1. Convert the files with 755 permissions to 644</a></li>
<li><a href="#orgc2a7706">8.2. Pictures, etc.</a></li>
</ul>
</li>
<li><a href="#orgf55d069">9. VC</a>
<ul>
<li><a href="#org996a2e1">9.1. Ignore files from the command line</a></li>
</ul>
</li>
<li><a href="#orgb315fb9">10. Web security assessments</a>
<ul>
<li><a href="#org189e2ad">10.1. HTTP</a></li>
<li><a href="#org4726528">10.2. HTTPS</a></li>
</ul>
</li>
<li><a href="#orgf774c86">11. Netcat</a>
<ul>
<li><a href="#org4d29b4f">11.1. Scan only certain ports</a></li>
<li><a href="#org204afce">11.2. DNS</a></li>
<li><a href="#org45c242d">11.3. Spoof source IP address</a></li>
<li><a href="#orgbd4b24b">11.4. Socat</a></li>
<li><a href="#org287820b">11.5. Packet forger</a></li>
<li><a href="#org4444414">11.6. Lauching attacks via Tor</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgab6b754">(format-time-string <span class="org-string">"%Y%m%d.%H%M"</span>)
</pre>
</div>

<div id="outline-container-org53b1121" class="outline-2">
<h2 id="org53b1121"><span class="section-number-2">1</span> Context</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://explainshell.com/explain?cmd=find%20.%20-type%20f%20-iname%20%22*.m%22%20-exec%20rgrep.1%20-i%20%22Content%22%20%7B%7D%20%2B">https://explainshell.com/explain?cmd=find%20.%20-type%20f%20-iname%20%22*.m%22%20-exec%20rgrep.1%20-i%20%22Content%22%20%7B%7D%20%2B</a>
</p>
</div>

<div id="outline-container-org49ccb81" class="outline-3">
<h3 id="org49ccb81"><span class="section-number-3">1.1</span> Description</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The shell utilities are core shell functions and scripts which I wrote when
doing my day-to-day tasks.  Over time, this will become a <b>powerful toolkit</b>.
</p>

<div class="note">
<p>
Library of Babel needs the <code>#+name</code> field to &ldquo;ingest&rdquo; a code block &#x2013; for Org mode
users.
</p>

</div>
</div>
</div>

<div id="outline-container-org97b307c" class="outline-3">
<h3 id="org97b307c"><span class="section-number-3">1.2</span> See also</h3>
<div class="outline-text-3" id="text-1-2">
<p>
For similar collections, see:
</p>

<ul class="org-ul">
<li><a href="http://icodesnippet.com/">http://icodesnippet.com/</a></li>
<li><a href="http://exploitsdownload.com/">http://exploitsdownload.com/</a></li>
<li><a href="http://code.google.com/">http://code.google.com/</a></li>
<li><a href="https://bbs.archlinux.org/viewtopic.php?id=56646&amp;p=1">Post your handy self made command line utilities</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbc7be9f" class="outline-3">
<h3 id="orgbc7be9f"><span class="section-number-3">1.3</span> Coding style</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="http://wiki.bash-hackers.org/scripting/style">http://wiki.bash-hackers.org/scripting/style</a></li>

<li><p>
<a href="https://google-styleguide.googlecode.com/svn/trunk/shell.xml">https://google-styleguide.googlecode.com/svn/trunk/shell.xml</a>
</p>

<p>
<code>variable_name</code> (preferred, <code>variableName</code> accepted) <br />
<code>function_name</code> <br />
<code>CONSTANT_NAME</code>
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org315c7c5" class="outline-3">
<h3 id="org315c7c5"><span class="section-number-3">1.4</span> Shell formatter + checker</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><a href="https://github.com/mvdan/sh">https://github.com/mvdan/sh</a></li>
<li><a href="https://google.github.io/styleguide/shell.xml">https://google.github.io/styleguide/shell.xml</a></li>
<li><a href="https://www.shellcheck.net/">https://www.shellcheck.net/</a> (online checker!)</li>
</ul>

<p>
<a href="http://www.skybert.net/emacs/bash-linting-in-emacs/">http://www.skybert.net/emacs/bash-linting-in-emacs/</a>
</p>
</div>
</div>

<div id="outline-container-org5d4d9b5" class="outline-3">
<h3 id="org5d4d9b5"><span class="section-number-3">1.5</span> Prerequisites</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Clear</li>
<li>Diff</li>
<li>Iconv</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org53cac74" class="outline-2">
<h2 id="org53cac74"><span class="section-number-2">2</span> Core utilities</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgaf452bf" class="outline-3">
<h3 id="orgaf452bf"><span class="section-number-3">2.1</span> Reverse the order of lines in a file</h3>
<div class="outline-text-3" id="text-2-1">
<p>
tac (the, ahem, reverse of cat). Part of coreutils.
</p>

<p>
Flipping one file into another
</p>

<div class="org-src-container">
<pre class="src src-shell">tac a.txt &gt; b.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b07038" class="outline-3">
<h3 id="org1b07038"><span class="section-number-3">2.2</span> Difference between two directories</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-shell">colordiff -urb dir1 dir2
colordiff -qr dir1 dir2 | sort
</pre>
</div>

<p>
Options explained:
</p>
<dl class="org-dl">
<dt>-q</dt><dd>Output only whether files differ!</dd>
<dt>-u</dt><dd>Output NUM (default 3) lines of unified context.</dd>
<dt>-r</dt><dd>Recursively compare any subdirectories found.</dd>
<dt>-b</dt><dd>Ignore white space changes.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org2e87723" class="outline-2">
<h2 id="org2e87723"><span class="section-number-2">3</span> Shell aliases</h2>
<div class="outline-text-2" id="text-3">
<p>
XXX Do they need to be added to <code>~/.bash_aliases</code>?
</p>
</div>

<div id="outline-container-org2e766ba" class="outline-3">
<h3 id="org2e766ba"><span class="section-number-3">3.1</span> Remove duplicate lines without sorting</h3>
<div class="outline-text-3" id="text-3-1">
<p>
How to <b>delete duplicate lines</b> in a file <b>without sorting</b> it?
</p>

<pre class="example">
awk '!seen[$0]++' file.txt
</pre>


<p>
<a href="https://stackoverflow.com/questions/1444406/how-to-delete-duplicate-lines-in-a-file-without-sorting-it-in-unix">https://stackoverflow.com/questions/1444406/how-to-delete-duplicate-lines-in-a-file-without-sorting-it-in-unix</a>
</p>
</div>
</div>

<div id="outline-container-org9674cff" class="outline-3">
<h3 id="org9674cff"><span class="section-number-3">3.2</span> Find all of the distinct file extensions in a folder hierarchy</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Find executable file extensions:
</p>

<pre class="example">
find . -executable -type f | awk -F'.' '{print $NF;}'
</pre>


<p>
Recursive version:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> <span class="org-variable-name">file_ext</span>=$<span class="org-string">'find . -type f -name "*.*" | awk -F. \'</span>!a[$<span class="org-variable-name">NF</span>]++{print $<span class="org-variable-name">NF</span>}<span class="org-string">\''</span>
</pre>
</div>

<p>
Recursive version:
</p>

<div class="org-src-container">
<pre class="src src-shell">find . -type f | sed -e <span class="org-string">'s/.*\.//'</span> | sed -e <span class="org-string">'s/.*\///'</span> | sort -u
</pre>
</div>

<p>
If you want totals (how may times the extension was seen):
</p>

<div class="org-src-container">
<pre class="src src-shell">find . -type f | sed -e <span class="org-string">'s/.*\.//'</span> | sed -e <span class="org-string">'s/.*\///'</span> | sort | uniq -c | sort -rn
</pre>
</div>

<p>
Non-recursive (single folder):
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-keyword">for</span> f<span class="org-keyword"> in</span> *.*; <span class="org-keyword">do </span><span class="org-builtin">printf</span> <span class="org-string">"%s\n"</span> <span class="org-string">"${f##*.}"</span>; <span class="org-keyword">done</span> | sort -u
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb9428e5" class="outline-2">
<h2 id="orgb9428e5"><span class="section-number-2">4</span> Shell functions</h2>
<div class="outline-text-2" id="text-4">
<p>
Only use alphanumeric characters and the underscore for function names.
</p>
</div>
