shell-utils.org
** Exit with an error

The exit status follows the conventions for programs such as ~grep~, ~cmp~, and
~diff~: it is 2 (or greater) if an error occurred.

#+begin_src shell
die() {
    printf "$(basename $0): $@\n" > /dev/stderr
    exit 2                              # An error occurred.
}
#+end_src

~Die~ *must be a function* so that the calling script does exit with an error.

** Check for executable files

~has~ checks presence of various command line tools on the PATH.

#+begin_src shell
has() {
    for cmd in "$@"; do
        command -v $cmd > /dev/null || die "$cmd not found."
    done
}
#+end_src

** Check for Cygwin executable files

We sometimes have to check that the ~PATH~ is set right, so that Cygwin
executables (for example, ~whoami~ and ~hostname~) are found before their Windows
counterpart -- to avoid problems of spurious ~\r~ added to the output.

#+begin_src shell
has-cygwin() {
    for x in $@; do
        [ "$(command -v $x)" = "/usr/bin/$x" ] \
            || die "$x is not a Cygwin executable."
    done
}
#+end_src

** Find the name of the parent process

The following is supposed to work on Linux, but doesn't on Cygwin.

#+begin_src shell
pname() {
    ps -o command= -p $PPID | tail -n 1 | awk '{print $1}' | awk -F/ '{print $NF}'
}
#+end_src

** Find files

#+begin_src shell :tangle ~/.dotfiles/bin/fd
find . -type d -iname "*$1*" -printf '%P\n'
#+end_src

#+begin_src shell :tangle ~/.dotfiles/bin/ff
find . -type f -iname "*$1*" -printf '%P\n'
#+end_src

Alternatively, if piping commands, avoid *buffered output* by applying ~stdbuf -oL~
to ~find~ (force flushing of output).

: stdbuf -oL find . -type f -iname "*$1*" -print | sed "s#\./##"

The buffering is on the output side of the pipe, not the input side.

** Find recent files

#+begin_src shell
# List all files modified TODAY only (since start of day only, i.e. 00:00).
alias today='find . -daystart -mtime 0 -type f -printf "  %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"'

# List all files modified YESTERDAY.
alias yesterday='find . -daystart -mtime 1 -type f -printf "  %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"'

# List all files modified THIS WEEK.
alias thisweek1='find . -mtime -7 -type f -printf "  %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"'
alias thisweek2='find . -mtime 7 -type f -printf "  %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"'
alias thisweek3='find . -daystart -mtime 7 -type f -printf "  %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"'
#+end_src

XXX Check out %C, %T and %A!!!

See https://unix.stackexchange.com/questions/26313/colored-find-output for
*colored find output*.

** Find recent files
:PROPERTIES:
:header-args+: :shebang #!/usr/bin/env bash
:END:

It recursively finds all files containing the pattern of the first argument
passed to the command (~fr <pattern>~) and sorts them with the most recent one
last.

Options (to ~es~, Everything):
-r Search the database using a basic POSIX regular expression.
-i Does a case sensitive search.
-w Does a whole word search.
-p Does a full path search.
-h --help Display this help.
-n <num> Limit the amount of results shown to <num>.
-s Sort by full path.

#+begin_src shell :tangle ~/.dotfiles/bin/dc
# Date Created.
find . -iname "*"$@"*" -printf "%A@ %AY-%Am-%Ad %Aa %AH:%AM - %P\n" \
    | sort -n \
    | cut -d " " -f 2- \ \
    | grep -i "$@";
#+end_src

#+begin_src shell :tangle ~/.dotfiles/bin/dm
# Date Modified.
# find . -mmin 1440 -iname "*"$@"*" -printf "%T@ %TY-%Tm-%Td %Ta %TH:%TM - %P\n" \
find . -iname "*"$@"*" -printf "%T@ %TY-%Tm-%Td %Ta %TH:%TM - %P\n" \
    | sort -n \
    | cut -d " " -f 2- \ \
    | grep -i "$@";
#+end_src

~dm~ will show files and folders that have been altered in content today (their
"date modified" field has been changed).

XXX Includes copies?

#+begin_src shell
alias last-modified='find . -type f -print0 | xargs -0 stat --format "%Y :%y %n" 2>/dev/null | sort -nr | cut -d: -f2- | head'
#+end_src

#+begin_src shell :tangle ~/.dotfiles/bin/rc
# Recent Change.
find . -iname "*"$@"*" -printf "%C@ %CY-%Cm-%Cd %Ca %CH:%CM - %P\n" \
    | sort -n \
    | cut -d " " -f 2- \ \
    | grep -i "$@";
#+end_src

~rc~ includes moves and renames that do not change the "date modified" field or
the contents of the files or folders.

XXX See
https://superuser.com/questions/294161/unix-linux-find-and-sort-by-date-modified
for improvements (using ~ssed~ and ~cut~ with complement option).

* Shell scripts
:PROPERTIES:
:header-args+: :shebang #!/usr/bin/env bash
:END:

** Send an email
:PROPERTIES:
:header-args+: :tangle ~/.dotfiles/bin/mail :shebang #!/usr/bin/env bash
:END:

Send a mail to one or more people.

*** Name

#+begin_src shell :noweb yes :padline no
# mail -- Send simple mail
#+end_src

