shell-utils.html

<div id="outline-container-org878c9d8" class="outline-3">
<h3 id="org878c9d8"><span class="section-number-3">4.1</span> Exit with an error</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The exit status follows the conventions for programs such as <code>grep</code>, <code>cmp</code>, and
<code>diff</code>: it is 2 (or greater) if an error occurred.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-function-name">die</span>() {
    <span class="org-builtin">printf</span> <span class="org-string">"$(</span><span class="org-sh-quoted-exec">basename</span><span class="org-string"> $0): $@\n"</span> &gt; /dev/stderr
    <span class="org-keyword">exit</span> 2                              <span class="org-comment-delimiter"># </span><span class="org-comment">An error occurred.</span>
}
</pre>
</div>

<p>
<code>Die</code> <b>must be a function</b> so that the calling script does exit with an error.
</p>
</div>
</div>

<div id="outline-container-org215bb08" class="outline-3">
<h3 id="org215bb08"><span class="section-number-3">4.2</span> Check for executable files</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-function-name">files_executables_p</span>() {
    <span class="org-keyword">for</span> x<span class="org-keyword"> in</span> $<span class="org-variable-name">@</span>; <span class="org-keyword">do</span>
        <span class="org-builtin">command</span> -v $<span class="org-variable-name">x</span> &gt; /dev/null || die <span class="org-string">"$x not found."</span>
    <span class="org-keyword">done</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgacdcca3" class="outline-3">
<h3 id="orgacdcca3"><span class="section-number-3">4.3</span> Check for Cygwin executable files</h3>
<div class="outline-text-3" id="text-4-3">
<p>
We sometimes have to check that the <code>PATH</code> is set right, so that Cygwin
executables (for example, <code>whoami</code> and <code>hostname</code>) are found before their Windows
counterpart &#x2013; to avoid problems of spurious <code>\r</code> added to the output.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-function-name">files_cygwin_executables_p</span>() {
    <span class="org-keyword">for</span> x<span class="org-keyword"> in</span> $<span class="org-variable-name">@</span>; <span class="org-keyword">do</span>
        [ <span class="org-string">"$(</span><span class="org-sh-quoted-exec">command</span><span class="org-string"> -v $x)"</span> = <span class="org-string">"/usr/bin/$x"</span> ] <span class="org-sh-escaped-newline">\</span>
            || die <span class="org-string">"$x is not a Cygwin executable."</span>
    <span class="org-keyword">done</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb53d1a" class="outline-3">
<h3 id="orgeb53d1a"><span class="section-number-3">4.4</span> Find the name of the parent process</h3>
<div class="outline-text-3" id="text-4-4">
<p>
The following is supposed to work on Linux, but doesn&rsquo;t on Cygwin.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-function-name">pname</span>() {
    ps -o <span class="org-variable-name">command</span>= -p $<span class="org-variable-name">PPID</span> | tail -n 1 | awk <span class="org-string">'{print $1}'</span> | awk -F/ <span class="org-string">'{print $NF}'</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org99ebd20" class="outline-3">
<h3 id="org99ebd20"><span class="section-number-3">4.5</span> Find files</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-shell">find . -type d -iname <span class="org-string">"*$1*"</span> -printf <span class="org-string">'%P\n'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">find . -type f -iname <span class="org-string">"*$1*"</span> -printf <span class="org-string">'%P\n'</span>
</pre>
</div>

<p>
Alternatively, if piping commands, avoid <b>buffered output</b> by applying <code>stdbuf -oL</code>
to <code>find</code>.
</p>

<pre class="example">
stdbuf -oL find . -type f -iname "*$1*" -print | sed "s#\./##"
</pre>


<p>
The buffering is on the output side of the pipe, not the input side.
</p>
</div>
</div>

<div id="outline-container-org217a552" class="outline-3">
<h3 id="org217a552"><span class="section-number-3">4.6</span> Find recent files</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">List all files modified TODAY only (since start of day only, i.e. 00:00).</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">today</span>=<span class="org-string">'find . -daystart -mtime 0 -type f -printf "  %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">List all files modified YESTERDAY.</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">yesterday</span>=<span class="org-string">'find . -daystart -mtime 1 -type f -printf "  %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">List all files modified THIS WEEK.</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">thisweek1</span>=<span class="org-string">'find . -mtime -7 -type f -printf "  %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">thisweek2</span>=<span class="org-string">'find . -mtime 7 -type f -printf "  %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"'</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">thisweek3</span>=<span class="org-string">'find . -daystart -mtime 7 -type f -printf "  %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"'</span>
</pre>
</div>

<p>
XXX Check out %C, %T and %A!!!
</p>

<p>
See <a href="https://unix.stackexchange.com/questions/26313/colored-find-output">https://unix.stackexchange.com/questions/26313/colored-find-output</a> for
<b>colored find output</b>.
</p>
</div>
</div>

<div id="outline-container-orgb7970ea" class="outline-3">
<h3 id="orgb7970ea"><span class="section-number-3">4.7</span> Find recent files</h3>
<div class="outline-text-3" id="text-4-7">
<p>
It recursively finds all files containing the pattern of the first argument
passed to the command (<code>fr &lt;pattern&gt;</code>) and sorts them with the most recent one
last.
</p>

<p>
Options (to <code>es</code>, Everything):
-r Search the database using a basic POSIX regular expression.
-i Does a case sensitive search.
-w Does a whole word search.
-p Does a full path search.
-h &#x2013;help Display this help.
-n &lt;num&gt; Limit the amount of results shown to &lt;num&gt;.
-s Sort by full path.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Date Created.</span>
find . -iname <span class="org-string">"*"</span>$<span class="org-variable-name">@</span><span class="org-string">"*"</span> -printf <span class="org-string">"%A@ %AY-%Am-%Ad %Aa %AH:%AM - %P\n"</span> <span class="org-sh-escaped-newline">\</span>
    | sort -n <span class="org-sh-escaped-newline">\</span>
    | cut -d <span class="org-string">" "</span> -f 2- <span class="org-string">\ </span><span class="org-sh-escaped-newline">\</span>
    | grep -i <span class="org-string">"$@"</span>;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Date Modified.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">find . -mmin 1440 -iname "*"$@"*" -printf "%T@ %TY-%Tm-%Td %Ta %TH:%TM - %P\n" \</span>
find . -iname <span class="org-string">"*"</span>$<span class="org-variable-name">@</span><span class="org-string">"*"</span> -printf <span class="org-string">"%T@ %TY-%Tm-%Td %Ta %TH:%TM - %P\n"</span> <span class="org-sh-escaped-newline">\</span>
    | sort -n <span class="org-sh-escaped-newline">\</span>
    | cut -d <span class="org-string">" "</span> -f 2- <span class="org-string">\ </span><span class="org-sh-escaped-newline">\</span>
    | grep -i <span class="org-string">"$@"</span>;
</pre>
</div>

<p>
<code>dm</code> will show files and folders that have been altered in content today (their
&ldquo;date modified&rdquo; field has been changed).
</p>

<p>
XXX Includes copies?
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> last-modified=<span class="org-string">'find . -type f -print0 | xargs -0 stat --format "%Y :%y %n" 2&gt;/dev/null | sort -nr | cut -d: -f2- | head'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Recent Change.</span>
find . -iname <span class="org-string">"*"</span>$<span class="org-variable-name">@</span><span class="org-string">"*"</span> -printf <span class="org-string">"%C@ %CY-%Cm-%Cd %Ca %CH:%CM - %P\n"</span> <span class="org-sh-escaped-newline">\</span>
    | sort -n <span class="org-sh-escaped-newline">\</span>
    | cut -d <span class="org-string">" "</span> -f 2- <span class="org-string">\ </span><span class="org-sh-escaped-newline">\</span>
    | grep -i <span class="org-string">"$@"</span>;
</pre>
</div>

<p>
<code>rc</code> includes moves and renames that do not change the &ldquo;date modified&rdquo; field or
the contents of the files or folders.
</p>

<p>
XXX See
<a href="https://superuser.com/questions/294161/unix-linux-find-and-sort-by-date-modified">https://superuser.com/questions/294161/unix-linux-find-and-sort-by-date-modified</a>
for improvements (using <code>ssed</code> and <code>cut</code> with complement option).
</p>
</div>
</div>
</div>

<div id="outline-container-org608c48d" class="outline-2">
<h2 id="org608c48d"><span class="section-number-2">5</span> Shell scripts</h2>
<div class="outline-text-2" id="text-5">
</div>

<div id="outline-container-org04ac764" class="outline-3">
<h3 id="org04ac764"><span class="section-number-3">5.1</span> Send an email</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Send a mail to one or more people.
</p>
</div>

<div id="outline-container-org8732803" class="outline-4">
<h4 id="org8732803"><span class="section-number-4">5.1.1</span> Name</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">mail -- Send simple mail</span>
</pre>
</div>
</div>
</div>
