shell-utils.html

<div id="outline-container-org5395f99" class="outline-4">
<h4 id="org5395f99"><span class="section-number-4">5.1.2</span> Synopsis</h4>
<div class="outline-text-4" id="text-5-1-2">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-function-name">Usage</span>()
{
    cat &lt;&lt; EOF 1&gt;&amp;2
<span class="org-sh-heredoc">Usage: $CMD [-s SUBJECT] [-a ATTACHMENT]... [-c CC-ADDR] [-b BCC-ADDR] [-f FROM-ADDR] TO-ADDR</span>
<span class="org-sh-heredoc">Try '$CMD -h' for more information.</span>
<span class="org-sh-heredoc">EOF</span>
    <span class="org-keyword">exit</span> 2
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0db8960" class="outline-4">
<h4 id="org0db8960"><span class="section-number-4">5.1.3</span> Description</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
Send an email using <code>mail</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell">mail -s <span class="org-string">"Subject"</span> recipient@example.com &lt; /path/to/file
cat /path/to/file | mail -s <span class="org-string">"Subject"</span> recipient@example.com
<span class="org-builtin">echo</span> <span class="org-string">"Message"</span> | mail -s <span class="org-string">"Subject"</span> recipient@example.com
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f01205" class="outline-4">
<h4 id="org2f01205"><span class="section-number-4">5.1.4</span> Options</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
The following options shall be supported:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-function-name">Help</span>()
{
    cat &lt;&lt; EOF
<span class="org-sh-heredoc">This is $CMD, version: 20191126.1155.</span>

<span class="org-sh-heredoc">Usage: $CMD [-s SUBJECT] [-a ATTACHMENT]... [-c CC-ADDR] [-b BCC-ADDR] [-f FROM-ADDR] TO-ADDR</span>
<span class="org-sh-heredoc">Send simple mail.</span>
<span class="org-sh-heredoc">Examples:</span>
<span class="org-sh-heredoc">    $CMD -s 'Disk failure' bill@example.com &lt; /tmp/message</span>
<span class="org-sh-heredoc">    print "This is the body." | $CMD -s 'Other subject' bill@example.com</span>

<span class="org-sh-heredoc">Options:</span>
<span class="org-sh-heredoc">  -s  Specify subject on command line</span>
<span class="org-sh-heredoc">  -a  Attach a file</span>
<span class="org-sh-heredoc">  -c  Send carbon copies to (comma separated) list of recipients</span>
<span class="org-sh-heredoc">  -b  Send blind carbon copies to (comma separated) list of recipients</span>
<span class="org-sh-heredoc">  -f  Set the From address</span>
<span class="org-sh-heredoc">  -h  Display this help and exit</span>
<span class="org-sh-heredoc">EOF</span>
    <span class="org-keyword">exit</span> 0
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9814b8b" class="outline-4">
<h4 id="org9814b8b"><span class="section-number-4">5.1.5</span> Stdin</h4>
<div class="outline-text-4" id="text-5-1-5">
<p>
When <code>mail</code> is invoked, standard input shall be the message to be delivered to
the specified addresses.
</p>
</div>
</div>

<div id="outline-container-orgbb9a03c" class="outline-4">
<h4 id="orgbb9a03c"><span class="section-number-4">5.1.6</span> Input files</h4>
<div class="outline-text-4" id="text-5-1-6">
<p>
None.
</p>
</div>
</div>

<div id="outline-container-orga97f0b2" class="outline-4">
<h4 id="orga97f0b2"><span class="section-number-4">5.1.7</span> Environment variables</h4>
<div class="outline-text-4" id="text-5-1-7">
<p>
The behavior of <code>mail</code> is affected by the following environment variable:
</p>

<dl class="org-dl">
<dt><code>SMTP</code></dt><dd>The SMTP connection is made to the server specified by the variable <code>SMTP</code>.</dd>
</dl>
</div>
</div>

<div id="outline-container-org9c562fa" class="outline-4">
<h4 id="org9c562fa"><span class="section-number-4">5.1.8</span> Stdout</h4>
<div class="outline-text-4" id="text-5-1-8">
<p>
The standard output shall be that of the <code>blat</code> command.
</p>
</div>
</div>

<div id="outline-container-orgbfe9568" class="outline-4">
<h4 id="orgbfe9568"><span class="section-number-4">5.1.9</span> Stderr</h4>
<div class="outline-text-4" id="text-5-1-9">
<p>
The standard error shall be used only for diagnostic messages.
</p>
</div>
</div>

<div id="outline-container-org8d32b1b" class="outline-4">
<h4 id="org8d32b1b"><span class="section-number-4">5.1.10</span> Output files</h4>
<div class="outline-text-4" id="text-5-1-10">
<p>
None.
</p>
</div>
</div>

<div id="outline-container-org780a577" class="outline-4">
<h4 id="org780a577"><span class="section-number-4">5.1.11</span> Exit status</h4>
<div class="outline-text-4" id="text-5-1-11">
<p>
The <code>mail</code> utility returns one of the following values upon exit:
</p>

<dl class="org-dl">
<dt>0</dt><dd>Successful completion: one mail was sent.</dd>

<dt>2</dt><dd>Invalid options were specified on the command line or shell input was
missing.</dd>
</dl>

<p>
Otherwise, the exit status of <code>mail</code> shall be that of the <code>blat</code> command.
</p>
</div>
</div>

<div id="outline-container-org4e7d223" class="outline-4">
<h4 id="org4e7d223"><span class="section-number-4">5.1.12</span> Examples</h4>
<div class="outline-text-4" id="text-5-1-12">
<p>
Here&rsquo;s a shell script that reports the disk usage:
</p>

<div class="org-src-container">
<pre class="src src-shell">( <span class="org-builtin">printf</span> <span class="org-string">"Disk usage:\n"</span> ; du -sh ) | mail -s <span class="org-string">"Disk usage report"</span> recipient@example.com
</pre>
</div>

<p>
Here&rsquo;s another one to backup a configuration folder, archive it, and send it as
an attachment:
</p>

<div class="org-src-container">
<pre class="src src-shell">tar -zcf ~/backup.tar.gz ~/files_to_backup
<span class="org-builtin">printf</span> <span class="org-string">"Archived configuration files\n"</span> | mail -s <span class="org-string">"Backup data"</span> -a ~/backup.tar.gz recipient@example.com
</pre>
</div>
</div>
</div>
