shell-utils.org
*** Code

#+begin_src shell
# command name
CMD=$(basename "$0")

. shellutils || exit 2

if [ $# -eq 0 ]; then
    Usage
fi

# check for Cygwin executable files (and not their Windows counterpart)
has-cygwin "whoami" "hostname"

# default values
SUBJECT="none"
ATTFILES=""                             # files to be attached
CC=""
BCC=""
FROM="<$(whoami)@$(echo "$(hostname)".com | tr '[:upper:]' '[:lower:]')>"
: "${SMTP:=smtp}"                     # set var if not already set

while getopts "s:c:b:f:a:h" opt
do
    case "$opt" in
        s) SUBJECT="$OPTARG";;
        a) ATTFILES="$ATTFILES $OPTARG";;
        c) CC="$OPTARG";;
        b) BCC="$OPTARG";;
        f) FROM="$OPTARG";;
        h) Help;;
        ,*) Usage;;
    esac
done
shift $((OPTIND - 1))

MAILTO="$1"
if [ "$MAILTO" = "" ]; then
    Usage
fi

# check presence of stdin contents
[ -t 0 ] && die "Message body is missing."

# check presence of blat command
has "blat"

ATT_SWITCH=""
for attach in $ATTFILES
do
    if [ ! -r "$attach" ]
    then
        die "File $attach does not exist or is not readable."
    else
        # binary vs text file
        if [ "$(file --brief --mime "$attach" 2> /dev/null | cut -d/ -f 1)" = "text" ]
        then
            ATT_SWITCH="$ATT_SWITCH -attacht $(cygpath -w "$attach")"
        else
            ATT_SWITCH="$ATT_SWITCH -attach $(cygpath -w "$attach")"
        fi
    fi
done

CC_SWITCH=""
[ "$CC" = "" ] || CC_SWITCH="-cc ${CC}"

BCC_SWITCH=""
[ "$BCC" = "" ] || BCC_SWITCH="-bcc ${BCC}"

blat -to "$MAILTO" \
     "$CC_SWITCH" \
     "$BCC_SWITCH" \
     -subject "$SUBJECT" \
     -f "$FROM" \
     -server "$SMTP" \
     "$ATT_SWITCH"

# mail ends here
#+end_src

** Echo text in color

#+begin_src shell :tangle ~/.dotfiles/bin/cecho
cecho() {
    black="\e[30m"
    red="\e[31m"
    green="\e[32m"
    yellow="\e[33m"
    blue="\e[34m"
    magenta="\e[35m"
    cyan="\e[36m"
    white="\e[37m"

    BLACK="\e[1;30m"
    RED="\e[1;31m"
    GREEN="\e[1;32m"
    YELLOW="\e[1;33m"
    BLUE="\e[1;34m"
    MAGENTA="\e[1;35m"
    CYAN="\e[1;36m"
    WHITE="\e[1;37m"

    reset="\e[0m"

    color=${YELLOW}
    printf "$color$1$reset\n"
}

cecho "$@"
#+end_src

** Find duplicates

*** finddup -- Find DUPlicate files

Use ~fdupes~ (from Cygwin).

#+begin_src shell :tangle ~/.dotfiles/bin/finddup
fdupes -r . \
    | grep -v "/.svn/" \
    | grep -v "/.git/" \
    | grep -v "/.gitkeep" \
    | grep -v "/.emacs.d/backups" \
    | uniq
    | awk 'BEGIN {RS="\n\n"; ORS="\n\n"; FS="\n"} {if (NF>1) print}'
#+end_src

#+begin_note
~uniq~ deletes duplicate, consecutive lines.

The AWK script finds every block with more than one line.
#+end_note

