shell-utils.html

<div id="outline-container-orga0d9ed9" class="outline-4">
<h4 id="orga0d9ed9"><span class="section-number-4">5.1.13</span> Code</h4>
<div class="outline-text-4" id="text-5-1-13">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">command name</span>
<span class="org-variable-name">CMD</span>=$(<span class="org-sh-quoted-exec">basename</span> <span class="org-string">"$0"</span>)

<span class="org-builtin">.</span> shellutils || <span class="org-keyword">exit</span> 2

<span class="org-keyword">if</span> [ $<span class="org-variable-name">#</span> -eq 0 ]; <span class="org-keyword">then</span>
    Usage
<span class="org-keyword">fi</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">check for Cygwin executable files (and not their Windows counterpart)</span>
files_cygwin_executables_p <span class="org-string">"whoami"</span> <span class="org-string">"hostname"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">default values</span>
<span class="org-variable-name">SUBJECT</span>=<span class="org-string">"none"</span>
<span class="org-variable-name">ATTFILES</span>=<span class="org-string">""</span>                             <span class="org-comment-delimiter"># </span><span class="org-comment">files to be attached</span>
<span class="org-variable-name">CC</span>=<span class="org-string">""</span>
<span class="org-variable-name">BCC</span>=<span class="org-string">""</span>
<span class="org-variable-name">FROM</span>=<span class="org-string">"&lt;$(</span><span class="org-sh-quoted-exec">whoami</span><span class="org-string">)@$(</span><span class="org-sh-quoted-exec">echo</span><span class="org-string"> "$(</span><span class="org-sh-quoted-exec">hostname</span><span class="org-string">)".com | tr '[:upper:]' '[:lower:]')&gt;"</span>
: <span class="org-string">"${SMTP:=smtp}"</span>                     <span class="org-comment-delimiter"># </span><span class="org-comment">set var if not already set</span>

<span class="org-keyword">while </span><span class="org-builtin">getopts</span> <span class="org-string">"s:c:b:f:a:h"</span> opt
<span class="org-keyword">do</span>
    <span class="org-keyword">case</span> <span class="org-string">"$opt"</span><span class="org-keyword"> in</span>
        s) <span class="org-variable-name">SUBJECT</span>=<span class="org-string">"$OPTARG"</span>;;
        a) <span class="org-variable-name">ATTFILES</span>=<span class="org-string">"$ATTFILES $OPTARG"</span>;;
        c) <span class="org-variable-name">CC</span>=<span class="org-string">"$OPTARG"</span>;;
        b) <span class="org-variable-name">BCC</span>=<span class="org-string">"$OPTARG"</span>;;
        f) <span class="org-variable-name">FROM</span>=<span class="org-string">"$OPTARG"</span>;;
        h) Help;;
        *) Usage;;
    <span class="org-keyword">esac</span>
<span class="org-keyword">done</span>
<span class="org-builtin">shift</span> $((OPTIND - 1))

<span class="org-variable-name">MAILTO</span>=<span class="org-string">"$1"</span>
<span class="org-keyword">if</span> [ <span class="org-string">"$MAILTO"</span> = <span class="org-string">""</span> ]; <span class="org-keyword">then</span>
    Usage
<span class="org-keyword">fi</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">check presence of stdin contents</span>
[ -t 0 ] &amp;&amp; die <span class="org-string">"Message body is missing."</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">check for executable files</span>
files_executables_p <span class="org-string">"blat"</span>

<span class="org-variable-name">ATT_SWITCH</span>=<span class="org-string">""</span>
<span class="org-keyword">for</span> attach<span class="org-keyword"> in</span> $<span class="org-variable-name">ATTFILES</span>
<span class="org-keyword">do</span>
    <span class="org-keyword">if</span> [ <span class="org-negation-char">!</span> -r <span class="org-string">"$attach"</span> ]
    <span class="org-keyword">then</span>
        die <span class="org-string">"File $attach does not exist or is not readable."</span>
    <span class="org-keyword">else</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">binary vs text file</span>
        <span class="org-keyword">if</span> [ <span class="org-string">"$(</span><span class="org-sh-quoted-exec">file</span><span class="org-string"> --brief --mime "$attach" 2&gt; /dev/null | cut -d/ -f 1)"</span> = <span class="org-string">"text"</span> ]
        <span class="org-keyword">then</span>
            <span class="org-variable-name">ATT_SWITCH</span>=<span class="org-string">"$ATT_SWITCH -attacht $(</span><span class="org-sh-quoted-exec">cygpath</span><span class="org-string"> -w "$attach")"</span>
        <span class="org-keyword">else</span>
            <span class="org-variable-name">ATT_SWITCH</span>=<span class="org-string">"$ATT_SWITCH -attach $(</span><span class="org-sh-quoted-exec">cygpath</span><span class="org-string"> -w "$attach")"</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
<span class="org-keyword">done</span>

<span class="org-variable-name">CC_SWITCH</span>=<span class="org-string">""</span>
[ <span class="org-string">"$CC"</span> = <span class="org-string">""</span> ] || <span class="org-variable-name">CC_SWITCH</span>=<span class="org-string">"-cc ${CC}"</span>

<span class="org-variable-name">BCC_SWITCH</span>=<span class="org-string">""</span>
[ <span class="org-string">"$BCC"</span> = <span class="org-string">""</span> ] || <span class="org-variable-name">BCC_SWITCH</span>=<span class="org-string">"-bcc ${BCC}"</span>

blat -to <span class="org-string">"$MAILTO"</span> <span class="org-sh-escaped-newline">\</span>
     <span class="org-string">"$CC_SWITCH"</span> <span class="org-sh-escaped-newline">\</span>
     <span class="org-string">"$BCC_SWITCH"</span> <span class="org-sh-escaped-newline">\</span>
     -subject <span class="org-string">"$SUBJECT"</span> <span class="org-sh-escaped-newline">\</span>
     -f <span class="org-string">"$FROM"</span> <span class="org-sh-escaped-newline">\</span>
     -server <span class="org-string">"$SMTP"</span> <span class="org-sh-escaped-newline">\</span>
     <span class="org-string">"$ATT_SWITCH"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">mail ends here</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8b0cb41" class="outline-3">
<h3 id="org8b0cb41"><span class="section-number-3">5.2</span> Echo text in color</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-function-name">cecho</span>() {
    <span class="org-variable-name">black</span>=<span class="org-string">"\e[30m"</span>
    <span class="org-variable-name">red</span>=<span class="org-string">"\e[31m"</span>
    <span class="org-variable-name">green</span>=<span class="org-string">"\e[32m"</span>
    <span class="org-variable-name">yellow</span>=<span class="org-string">"\e[33m"</span>
    <span class="org-variable-name">blue</span>=<span class="org-string">"\e[34m"</span>
    <span class="org-variable-name">magenta</span>=<span class="org-string">"\e[35m"</span>
    <span class="org-variable-name">cyan</span>=<span class="org-string">"\e[36m"</span>
    <span class="org-variable-name">white</span>=<span class="org-string">"\e[37m"</span>

    <span class="org-variable-name">BLACK</span>=<span class="org-string">"\e[1;30m"</span>
    <span class="org-variable-name">RED</span>=<span class="org-string">"\e[1;31m"</span>
    <span class="org-variable-name">GREEN</span>=<span class="org-string">"\e[1;32m"</span>
    <span class="org-variable-name">YELLOW</span>=<span class="org-string">"\e[1;33m"</span>
    <span class="org-variable-name">BLUE</span>=<span class="org-string">"\e[1;34m"</span>
    <span class="org-variable-name">MAGENTA</span>=<span class="org-string">"\e[1;35m"</span>
    <span class="org-variable-name">CYAN</span>=<span class="org-string">"\e[1;36m"</span>
    <span class="org-variable-name">WHITE</span>=<span class="org-string">"\e[1;37m"</span>

    <span class="org-variable-name">reset</span>=<span class="org-string">"\e[0m"</span>

    <span class="org-variable-name">color</span>=${<span class="org-variable-name">YELLOW</span>}
    <span class="org-builtin">printf</span> <span class="org-string">"$color$1$reset\n"</span>
}

cecho <span class="org-string">"$@"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3595ef0" class="outline-3">
<h3 id="org3595ef0"><span class="section-number-3">5.3</span> Find duplicates</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-org8cb6378" class="outline-4">
<h4 id="org8cb6378"><span class="section-number-4">5.3.1</span> finddup &#x2013; Find DUPlicate files</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Use <code>fdupes</code> (from Cygwin).
</p>

<div class="org-src-container">
<pre class="src src-shell">fdupes -r . <span class="org-sh-escaped-newline">\</span>
    | grep -v <span class="org-string">"/.svn/"</span> <span class="org-sh-escaped-newline">\</span>
    | grep -v <span class="org-string">"/.git/"</span> <span class="org-sh-escaped-newline">\</span>
    | grep -v <span class="org-string">"/.gitkeep"</span> <span class="org-sh-escaped-newline">\</span>
    | grep -v <span class="org-string">"/.emacs.d/backups"</span> <span class="org-sh-escaped-newline">\</span>
    | uniq
    | awk <span class="org-string">'BEGIN {RS="\n\n"; ORS="\n\n"; FS="\n"} {if (NF&gt;1) print}'</span>
</pre>
</div>

<div class="note">
<p>
<code>uniq</code> deletes duplicate, consecutive lines.
</p>

<p>
The AWK script finds every block with more than one line.
</p>

</div>
</div>
</div>
