shell-utils.org
*** dupe -- Search for duplicated filenames

find (files) with duplicate or conflicting names.
Usage: findsn [-A -c -C] [[-r] [-f] paths(s) ...]

#+begin_src shell :tangle no
find . -type f | sort | uniq -c | grep -v "^[ \t]*1 "
#+end_src

#+begin_src shell :tangle no
#!/usr/bin/env bash

find -type f > names.lst

> names.out

TAB=`echo -ne "\t"`
while read name; do
    bn="$( basename "$name" )"
    name2="$( grep "$bn" names.lst | grep -v "$name" )"
    if [ "$name2" != "" ]; then
        if !(grep -q "^${name}${TAB}" names.out); then
            size=`stat --format=%s "$name"`
            size2=`stat --format=%s "$name2"`
            echo -e "$name${TAB}$size" >> names.out
            echo -e "$name2${TAB}$size" >> names.out
        fi
    fi
done < names.lst

cat names.out
rm -f names.lst
#+end_src

#+begin_src shell :tangle ~/.dotfiles/bin/dupe
# Find Duplicate File Names - By Dev (dk_mahadeva@yahoo.com)
# If no command-line parameter (path to begin from) is specified, then the
# default is to begin from the current (.) directory.
cd path=$1
: ${path:=.}
printf "Building file list...\n" > /dev/stderr
fullList=$(find `pwd` $path | grep -v '^\.' | awk -F '/' '{print $NF,$0}' | sort +0 -1)
fileNames=$(find `pwd` $path | grep -v '^\.' | awk -F '/' '{print $NF}' | sort | uniq -d)
for EACH in $fileNames; do
    echo "$fullList" | grep -wE "^$EACH "
    echo ""
done
exit 0
#+end_src

*** grep2 -- Find all AXVW files with two strings (Show AXVW files with both matches only)

(See Utilities.)

** Utils

#+begin_src shell :tangle ~/.dotfiles/bin/strip-dashes
# Strip lines with dashes.
sed "s/NULL//g"
#+end_src

#+begin_src shell :tangle ~/.dotfiles/bin/delete-2nd-line
# Delete the second line.
sed -e '2d'
#+end_src

#+begin_src shell :tangle ~/.dotfiles/bin/replace-null
# Replace NULL value by empty string.
sed "s/NULL//g"
#+end_src

* Findup
:PROPERTIES:
:header-args+: :tangle ~/.dotfiles/bin/findup :shebang #!/usr/bin/env bash
:END:

Search for the specified file(s) in the directory tree upwards, up to ~/~.

Usage:
: findup -name 'x*'

#+begin_src shell
set -e
while [[ $PWD != / ]]; do
    find "$PWD"/ -maxdepth 1 -mindepth 1 "$@"
    cd ..
done
#+end_src

* Compare two files and print unmatched lines / Deleting lines from one file which are in another file

Remove the lines from file which appear in another file.

** Comm

Compare two *sorted* files line by line.

- ~-1~ removes all lines unique to ~file1~,
- ~-2~ removes all lines that are only in ~file2~ and
- ~-3~ removes all lines that are *common* in both files.

The ~comm~ (with ~sort~) method take a long time on large files.

#+begin_src shell
# Print lines in file1 not in file2, and vice versa.
comm -3 <(sort file1) <(sort file2)
#+end_src

#+begin_src shell
# Print unmatched lines.
$ comm -13 <(sort file1) <(sort file2)
# Suppress the lines that are in both files, or only in file1.
#+end_src

*Remove the lines from file ~from-this.txt~ *which appear in file ~exclude-these.txt~.*
No cleanup needed!

#+begin_src shell
# Clear redundant contents in from-this.txt.
comm -23 from-this.txt exclude-these.txt | sponge from-this.txt
#+end_src

** AWK

Alternatively, an AWK solution to remove common lines between 2 files without
sorting -- *much faster* than ~sort~, and keeps the original order of the
=from-this.txt= file:

#+begin_src shell
awk 'NR == FNR { a[$0]++; next } { if (! a[$0]) print }' exclude-these.txt from-this.txt
#+end_src

#+begin_note
In Awk, ~FNR~ refers to the record number (typically the line number) in the
current file and ~NR~ refers to the total record number.  This means that the
condition ~NR==FNR~ is only true for the first file, as ~FNR~ resets back to 1 for
the first line of each file but ~NR~ keeps on increasing.

This pattern is typically used to perform actions on only the first file.  The
next inside the block means any further commands are skipped, so they are only
run on files other than the first.
#+end_note

If you're doing this with huge files, then the *memory constraints* of loading
a huge file into an associative array are going to be prohibitive.

** Diff

The downside of the above solutions is that it doesn't take line order into
account and, if your input has duplicate lines in different places, you might
not get what you expect.

The solution to that is to use a real comparison tool such as ~diff~.  You could
do this by creating a diff file with the context value at 100% of the lines in
the file, then parsing it for just the lines that would be removed if converting
file =from-this.txt= to file =exclude-these.txt=.  /(This command also removes the
diff formatting after it gets the right lines.)/

#+begin_src shell
colordiff -U $(wc -l < from-this.txt) from-this.txt exclude-these.txt | sed -n 's/^-//p'
#+end_src

Example:

#+begin_src shell
awk 'NR == FNR { a[$0]++; next } { if (! a[$0]) print }' dupes-standard.txt dupes-custo.txt
colordiff -U $(wc -l < dupes-custo.txt) dupes-custo.txt dupes-standard.txt | sed -n 's/^-//p'
#+end_src

