shell-utils.html

<div id="outline-container-orgddc82d8" class="outline-4">
<h4 id="orgddc82d8"><span class="section-number-4">5.3.2</span> dupe &#x2013; Search for duplicated filenames</h4>
<div class="outline-text-4" id="text-5-3-2">
<p>
find (files) with duplicate or conflicting names.
Usage: findsn [-A -c -C] [[-r] [-f] paths(s) &#x2026;]
</p>

<div class="org-src-container">
<pre class="src src-shell">find . -type f | sort | uniq -c | grep -v <span class="org-string">"^[ \t]*1 "</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/</span><span class="org-keyword">env</span><span class="org-comment"> bash</span>

find -type f &gt; names.lst

&gt; names.out

<span class="org-variable-name">TAB</span>=<span class="org-sh-quoted-exec">`echo -ne "\t"`</span>
<span class="org-keyword">while </span><span class="org-builtin">read</span> name; <span class="org-keyword">do</span>
    <span class="org-variable-name">bn</span>=<span class="org-string">"$( basename "$name" )"</span>
    <span class="org-variable-name">name2</span>=<span class="org-string">"$( grep "$bn" names.lst | grep -v "$name" )"</span>
    <span class="org-keyword">if</span> [ <span class="org-string">"$name2"</span> != <span class="org-string">""</span> ]; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> <span class="org-negation-char">!</span>(grep -q <span class="org-string">"^${name}${TAB}"</span> names.out); <span class="org-keyword">then</span>
            <span class="org-variable-name">size</span>=<span class="org-sh-quoted-exec">`stat --format=%s "$name"`</span>
            <span class="org-variable-name">size2</span>=<span class="org-sh-quoted-exec">`stat --format=%s "$name2"`</span>
            <span class="org-builtin">echo</span> -e <span class="org-string">"$name${TAB}$size"</span> &gt;&gt; names.out
            <span class="org-builtin">echo</span> -e <span class="org-string">"$name2${TAB}$size"</span> &gt;&gt; names.out
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
<span class="org-keyword">done</span> &lt; names.lst

cat names.out
rm -f names.lst
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Find Duplicate File Names - By Dev (dk_mahadeva@yahoo.com)</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">If no command-line parameter (path to begin from) is specified, then the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">default is to begin from the current (.) directory.</span>
<span class="org-builtin">cd</span> <span class="org-variable-name">path</span>=$<span class="org-variable-name">1</span>
: ${<span class="org-variable-name">path</span>:=.}
<span class="org-builtin">printf</span> <span class="org-string">"Building file list...\n"</span> &gt; /dev/stderr
<span class="org-variable-name">fullList</span>=$(<span class="org-sh-quoted-exec">find</span> <span class="org-sh-quoted-exec">`pwd`</span> $<span class="org-variable-name">path</span> | grep -v <span class="org-string">'^\.'</span> | awk -F <span class="org-string">'/'</span> <span class="org-string">'{print $NF,$0}'</span> | sort +0 -1)
<span class="org-variable-name">fileNames</span>=$(<span class="org-sh-quoted-exec">find</span> <span class="org-sh-quoted-exec">`pwd`</span> $<span class="org-variable-name">path</span> | grep -v <span class="org-string">'^\.'</span> | awk -F <span class="org-string">'/'</span> <span class="org-string">'{print $NF}'</span> | sort | uniq -d)
<span class="org-keyword">for</span> EACH<span class="org-keyword"> in</span> $<span class="org-variable-name">fileNames</span>; <span class="org-keyword">do</span>
    <span class="org-builtin">echo</span> <span class="org-string">"$fullList"</span> | grep -wE <span class="org-string">"^$EACH "</span>
    <span class="org-builtin">echo</span> <span class="org-string">""</span>
<span class="org-keyword">done</span>
<span class="org-keyword">exit</span> 0
</pre>
</div>
</div>
</div>

<div id="outline-container-org08ec754" class="outline-4">
<h4 id="org08ec754"><span class="section-number-4">5.3.3</span> grep2 &#x2013; Find all AXVW files with two strings (Show AXVW files with both matches only)</h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
(See Utilities.)
</p>
</div>
</div>
</div>

<div id="outline-container-org06a1854" class="outline-3">
<h3 id="org06a1854"><span class="section-number-3">5.4</span> Utils</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Strip lines with dashes.</span>
sed <span class="org-string">"s/NULL//g"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Delete the second line.</span>
sed -e <span class="org-string">'2d'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Replace NULL value by empty string.</span>
sed <span class="org-string">"s/NULL//g"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org77c8769" class="outline-2">
<h2 id="org77c8769"><span class="section-number-2">6</span> Findup</h2>
<div class="outline-text-2" id="text-6">
<p>
Search for the specified file(s) in the directory tree upwards, up to <code>/</code>.
</p>

<p>
Usage:
</p>
<pre class="example">
findup -name 'x*'
</pre>


<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">set</span> -e
<span class="org-keyword">while</span> [[ $<span class="org-variable-name">PWD</span> != / ]]; <span class="org-keyword">do</span>
    find <span class="org-string">"$PWD"</span>/ -maxdepth 1 -mindepth 1 <span class="org-string">"$@"</span>
    <span class="org-builtin">cd</span> ..
<span class="org-keyword">done</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6f438b1" class="outline-2">
<h2 id="org6f438b1"><span class="section-number-2">7</span> Compare two files and print unmatched lines / Deleting lines from one file which are in another file</h2>
<div class="outline-text-2" id="text-7">
<p>
Remove the lines from file which appear in another file.
</p>
</div>

<div id="outline-container-org5ff1aa4" class="outline-3">
<h3 id="org5ff1aa4"><span class="section-number-3">7.1</span> Comm</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Compare two <b>sorted</b> files line by line.
</p>

<ul class="org-ul">
<li><code>-1</code> removes all lines unique to <code>file1</code>,</li>
<li><code>-2</code> removes all lines that are only in <code>file2</code> and</li>
<li><code>-3</code> removes all lines that are <b>common</b> in both files.</li>
</ul>

<p>
The <code>comm</code> (with <code>sort</code>) method take a long time on large files.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Print lines in file1 not in file2, and vice versa.</span>
comm -3 &lt;(sort file1) &lt;(sort file2)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Print unmatched lines.</span>
$ comm -13 &lt;(sort file1) &lt;(sort file2)
<span class="org-comment-delimiter"># </span><span class="org-comment">Suppress the lines that are in both files, or only in file1.</span>
</pre>
</div>

<p>
<b>Remove the lines from file <code>from-this.txt</code> *which appear in file <code>exclude-these.txt</code>.</b>
No cleanup needed!
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Clear redundant contents in from-this.txt.</span>
comm -23 from-this.txt exclude-these.txt | sponge from-this.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3fed63" class="outline-3">
<h3 id="orgd3fed63"><span class="section-number-3">7.2</span> AWK</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Alternatively, an AWK solution to remove common lines between 2 files without
sorting &#x2013; <b>much faster</b> than <code>sort</code>, and keeps the original order of the
<code>from-this.txt</code> file:
</p>

<div class="org-src-container">
<pre class="src src-shell">awk <span class="org-string">'NR == FNR { a[$0]++; next } { if (! a[$0]) print }'</span> exclude-these.txt from-this.txt
</pre>
</div>

<div class="note">
<p>
In Awk, <code>FNR</code> refers to the record number (typically the line number) in the
current file and <code>NR</code> refers to the total record number.  This means that the
condition <code>NR==FNR</code> is only true for the first file, as <code>FNR</code> resets back to 1 for
the first line of each file but <code>NR</code> keeps on increasing.
</p>

<p>
This pattern is typically used to perform actions on only the first file.  The
next inside the block means any further commands are skipped, so they are only
run on files other than the first.
</p>

</div>

<p>
If you&rsquo;re doing this with huge files, then the <b>memory constraints</b> of loading
a huge file into an associative array are going to be prohibitive.
</p>
</div>
</div>

<div id="outline-container-org6adf987" class="outline-3">
<h3 id="org6adf987"><span class="section-number-3">7.3</span> Diff</h3>
<div class="outline-text-3" id="text-7-3">
<p>
The downside of the above solutions is that it doesn&rsquo;t take line order into
account and, if your input has duplicate lines in different places, you might
not get what you expect.
</p>

<p>
The solution to that is to use a real comparison tool such as <code>diff</code>.  You could
do this by creating a diff file with the context value at 100% of the lines in
the file, then parsing it for just the lines that would be removed if converting
file <code>from-this.txt</code> to file <code>exclude-these.txt</code>.  <i>(This command also removes the
diff formatting after it gets the right lines.)</i>
</p>

<div class="org-src-container">
<pre class="src src-shell">colordiff -U $(<span class="org-sh-quoted-exec">wc</span> -l &lt; from-this.txt) from-this.txt exclude-these.txt | sed -n <span class="org-string">'s/^-//p'</span>
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-shell">awk <span class="org-string">'NR == FNR { a[$0]++; next } { if (! a[$0]) print }'</span> dupes-standard.txt dupes-custo.txt
colordiff -U $(<span class="org-sh-quoted-exec">wc</span> -l &lt; dupes-custo.txt) dupes-custo.txt dupes-standard.txt | sed -n <span class="org-string">'s/^-//p'</span>
</pre>
</div>
</div>
</div>
</div>
