shell-utils.org
* Recursively run chmod -x?

** Convert the files with 755 permissions to 644

#+begin_src sh :tangle no
find . -type f -perm 755 -exec chmod 644 {} \;
#+end_src

#+begin_note
You could use ~+~ instead of ~\;~ to reduce the number of subprocesses created.
#+end_note

