shell-utils.html

<div id="outline-container-orga9b9966" class="outline-2">
<h2 id="orga9b9966"><span class="section-number-2">8</span> Recursively run chmod -x?</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org0c2ec29" class="outline-3">
<h3 id="org0c2ec29"><span class="section-number-3">8.1</span> Convert the files with 755 permissions to 644</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-sh">find . -type f -perm 755 -exec chmod 644 {} <span class="org-string">\;</span>
</pre>
</div>

<div class="note">
<p>
You could use <code>+</code> instead of <code>\;</code> to reduce the number of subprocesses created.
</p>

</div>
</div>
</div>
