shell-utils.html

<div id="outline-container-orgc2a7706" class="outline-3">
<h3 id="orgc2a7706"><span class="section-number-3">8.2</span> Pictures, etc.</h3>
<div class="outline-text-3" id="text-8-2">
<pre class="example">
find . -executable -type f | awk -F'.' '{print $NF;}' | sort | uniq -c
</pre>


<p>
There is no (good) reason ever for pictures to be executable.
</p>

<p>
Just run <code>unexe-all</code> to fix them.
</p>

<p>
See also <a href="https://www.lifewire.com/list-of-executable-file-extensions-2626061">https://www.lifewire.com/list-of-executable-file-extensions-2626061</a>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-builtin">echo</span> <span class="org-string">"Remove exe perm"</span>
find . -type f <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">\(</span> -name <span class="org-string">"*.DTD"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.DWG"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.MF"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.PDF"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.R"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.SQL"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.TTF"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.Txt"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.XE"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.actionScriptProperties"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.acts"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.appcache"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.asa"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.asp"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.awk"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.axvw"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.bak"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.bat"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.bmp"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.c"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.ced"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.cfg"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.checkstyle"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.class"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.classpath"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.css"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.csv"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.dflt"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.doc"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.docx"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.dtd"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.duw"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.dwg"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.el"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.emf"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.eot"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.fbprefs"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.flexProperties"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.frms"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.gemspec"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.gif"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.gitignore"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.htm"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.html"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.ico"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.idx"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.iml"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.ini"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.jar"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.java"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.jpeg"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.jpg"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.js"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.jsb"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.jshintignore"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.jshintrc"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.json"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.jsp"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.lang"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.launch"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.ldif"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.less"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.lex"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.lic"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.log"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.m"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.m4"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.md"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.md5"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.model"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.mp4"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.mpp"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.mxml"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.name"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.number"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.org"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.orig"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.otf"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.pack"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.pcx"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.pdf"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.php"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.pid"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.pmd"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.png"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.pptx"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.prefs"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.project"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.properties"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.psd"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.pspimage"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.py"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.rb"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.rpt"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.sample"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.scss"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.scssc"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.scssx"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.sed"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.springBeans"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.sql"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.stackdump"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.svg"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.swc"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.swf"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.tex"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.tgrp"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.tif"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.tld"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.tsv"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.ttf"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.txt"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.vm"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.war"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.woff"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.wsdl"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.xhtml"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.xls"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.xls"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.xlsx"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.xml"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.xsd"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.xsl"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.xslt"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.xslx"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.zip"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"*.zlib"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"ChangeLog"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"Makefile"</span> <span class="org-sh-escaped-newline">\</span>
    -o -name <span class="org-string">"README"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">\)</span> <span class="org-sh-escaped-newline">\</span>
    -exec chmod -x {} +
</pre>
</div>

<p>
Bonus:
</p>

<div class="org-src-container">
<pre class="src src-sh">find /space/music -type d -exec chmod o-w {} +
find /space/music -type d -exec chmod 755 {} +
</pre>
</div>

<p>
Explanation:
</p>

<p>
Most of the command line is self-explanatory. The only part that need some
insight is the ending. <code>{}</code> is replaced by the name of the files (resp directory)
found that match the filter. Usually, the find command is ended with a protected
semicolon <code>\;</code>.
</p>

<p>
However, this isn&rsquo;t efficient as the command is run once for each
file/directory.
</p>

<p>
There is a well known workaround that pipes <code>find</code> output to <code>xargs</code> which
concatenates the file names up to the maximum command line allowed but then
there is an issue when the path contains spaces, which is more and more common
even in the Unix/Linux world.
</p>

<p>
Again a workaround based on GNU specific extensions allows to properly handle
these case. I choose a simpler approach using a POSIX (read portable) way to
have find building itself the long command lines, i.e. <code>{}</code> is replaced by a suite
of file names up to the maximum number allowed.
</p>
</div>
</div>
</div>
