shell-utils.html

<div id="outline-container-orgf55d069" class="outline-2">
<h2 id="orgf55d069"><span class="section-number-2">9</span> VC</h2>
<div class="outline-text-2" id="text-9">
</div>

<div id="outline-container-org996a2e1" class="outline-3">
<h3 id="org996a2e1"><span class="section-number-3">9.1</span> Ignore files from the command line</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Add a file (or a file glob pattern) to ignore without deleting the previous
value of the <code>svn:ignore</code> property&#x2026; from the command line.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svnignore admin/notes/\*.tex</span>

<span class="org-variable-name">target</span>=<span class="org-string">"$1"</span>
<span class="org-variable-name">targetdirectory</span>=$(<span class="org-sh-quoted-exec">dirname</span> $<span class="org-variable-name">target</span>)
<span class="org-variable-name">targetfilepattern</span>=$(<span class="org-sh-quoted-exec">basename</span> $<span class="org-variable-name">target</span>)

<span class="org-variable-name">svnignores</span>=$(<span class="org-sh-quoted-exec">svn</span> propget svn:ignore <span class="org-string">"$targetdirectory"</span>)
<span class="org-variable-name">svnignores</span>=<span class="org-string">"$svnignores"</span>$<span class="org-string">'\n'"$targetfilepattern"</span>
<span class="org-builtin">printf</span> <span class="org-string">"Ignore '$targetfilepattern'\n"</span>
svn propset svn:ignore <span class="org-string">"$svnignores"</span> <span class="org-string">"$targetdirectory"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb315fb9" class="outline-2">
<h2 id="orgb315fb9"><span class="section-number-2">10</span> Web security assessments</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org189e2ad" class="outline-3">
<h3 id="org189e2ad"><span class="section-number-3">10.1</span> HTTP</h3>
<div class="outline-text-3" id="text-10-1">
<p>
From Hacking Exposed Web Applications:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/</span><span class="org-keyword">env</span><span class="org-comment"> sh</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">mike's getit.sh script</span>
<span class="org-keyword">if</span> [ -z $<span class="org-variable-name">1</span> ]; <span class="org-keyword">then</span>
    <span class="org-builtin">echo</span> -e <span class="org-string">"\n\tUsage: $0 &lt;host&gt; &lt;URL&gt;"</span>
    <span class="org-keyword">exit</span>
<span class="org-keyword">fi</span>
<span class="org-builtin">echo</span> -e <span class="org-string">"GET $2 HTTP/1.0\n\n"</span> | <span class="org-sh-escaped-newline">\</span>
nc -vv $<span class="org-variable-name">1</span> 80
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">getit.sh www.missioncriticalit.com /index.html
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">getit.sh www.victim.com /index.html | grep -i <span class="org-string">"&lt;form"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">getit.sh www.victim.com /index.html | grep -i <span class="org-string">"input type"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4726528" class="outline-3">
<h3 id="org4726528"><span class="section-number-3">10.2</span> HTTPS</h3>
<div class="outline-text-3" id="text-10-2">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/</span><span class="org-keyword">env</span><span class="org-comment"> sh</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">mike's sgetit.sh script</span>
<span class="org-keyword">if</span> [ -z $<span class="org-variable-name">1</span> ]; <span class="org-keyword">then</span>
    <span class="org-builtin">echo</span> -e <span class="org-string">"\n\tUsage: $0 &lt;SSL host&gt; &lt;URL&gt;"</span>
    <span class="org-keyword">exit</span>
<span class="org-keyword">fi</span>
<span class="org-builtin">echo</span> -e <span class="org-string">"GET $2 HTTP/1.0\n\n"</span> | <span class="org-sh-escaped-newline">\</span>
openssl s_client -quiet -connect $<span class="org-variable-name">1</span>:443 2&gt;/dev/null
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">sgetit.sh www.victim.com /secure/admin.html
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf774c86" class="outline-2">
<h2 id="orgf774c86"><span class="section-number-2">11</span> Netcat</h2>
<div class="outline-text-2" id="text-11">
<p>
Here is a script which will port scan and banner grab automatically with
netcat. It will check for the SSH and MySQL version by connecting and saving
the results and it will see if the HTTP server is vulnerable to the <code>TRACE</code>
method, look in the dumpfile <code>/tmp/bannergrab</code> and look for
<code>&lt;script&gt;alert(123)&lt;/script&gt;</code> if you can find that back you got yourself a
vulnerable server.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/</span><span class="org-keyword">env</span><span class="org-comment"> sh</span>

<span class="org-variable-name">range</span>=<span class="org-string">"10.10.10."</span>;

<span class="org-comment-delimiter"># </span><span class="org-comment">You can change this to a port range $(</span><span class="org-sh-quoted-exec">seq</span><span class="org-comment"> 20 25) is port 20-25</span>
<span class="org-variable-name">ports</span>=<span class="org-string">"20 21 22 23 25 53 80 110 111 443 3306 6000"</span>;

<span class="org-variable-name">http_header</span>=<span class="org-string">"HEAD / HTTP/0.1\n\n"</span>;

<span class="org-keyword">for</span> host<span class="org-keyword"> in</span> $(<span class="org-sh-quoted-exec">seq</span> 2 254); <span class="org-keyword">do</span>
    <span class="org-keyword">for</span> port<span class="org-keyword"> in</span> $<span class="org-variable-name">ports</span>; <span class="org-keyword">do</span>
        <span class="org-builtin">echo</span> <span class="org-string">"[+] Testing "</span>$<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span><span class="org-string">":"</span>$<span class="org-variable-name">port</span>;
        <span class="org-variable-name">result</span>=$(<span class="org-sh-quoted-exec">nc</span> -zv -w 1 $<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span> $<span class="org-variable-name">port</span> 2&gt;&amp;1 | grep succeeded);
        <span class="org-keyword">if</span> [ -n <span class="org-string">"$result"</span> ]; <span class="org-keyword">then</span>
            <span class="org-builtin">echo</span> <span class="org-string">"\n"</span>$<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span><span class="org-string">":"</span>$<span class="org-variable-name">port</span><span class="org-string">"\n"</span> &gt;&gt; <span class="org-string">"/tmp/bannergrab"</span>
            <span class="org-keyword">if</span> [ <span class="org-string">"$port"</span> -eq <span class="org-string">"22"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">echo</span> <span class="org-string">"Found open port "</span>$<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span><span class="org-string">":"</span>$<span class="org-variable-name">port</span><span class="org-string">" Here might be some SSH server, it echoes the SSH version to you on connecting when lucky."</span>;
                nc -v -w 1 $<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span> $<span class="org-variable-name">port</span> &gt;&gt; <span class="org-string">"/tmp/bannergrab"</span>;
            <span class="org-keyword">fi</span>;
            <span class="org-keyword">if</span> [ <span class="org-string">"$port"</span> -eq <span class="org-string">"80"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">echo</span> <span class="org-string">"Found open port "</span>$<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span><span class="org-string">":"</span>$<span class="org-variable-name">port</span><span class="org-string">" Trying to fingerprint with HEAD and see if the server is vulnerable to TRACE XSSing"</span>;
                <span class="org-builtin">echo</span> $<span class="org-variable-name">http_header</span> | nc -v -w 1 $<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span> $<span class="org-variable-name">port</span> &gt;&gt; <span class="org-string">"/tmp/bannergrab"</span>
                <span class="org-builtin">echo</span> <span class="org-string">"TRACE / HTTP/1.1\nHost: $range$host\nuser-agent: &lt;script&gt;alert(123)&lt;/script&gt;\n\n"</span> | nc -v -w 2 $<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span> $<span class="org-variable-name">port</span> &gt;&gt; <span class="org-string">"/tmp/bannergrab"</span>
            <span class="org-keyword">fi</span>;
            <span class="org-keyword">if</span> [ <span class="org-string">"$port"</span> -eq <span class="org-string">"3306"</span> ]; <span class="org-keyword">then</span>
                <span class="org-builtin">echo</span> <span class="org-string">"Found open port "</span>$<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span><span class="org-string">":"</span>$<span class="org-variable-name">port</span><span class="org-string">" Possible MySQL installation found, saving the banner for later inspection, the MySQL version can be found in this."</span>;
                nc -v -w 1 $<span class="org-variable-name">range</span>$<span class="org-variable-name">host</span> $<span class="org-variable-name">port</span> &gt;&gt; <span class="org-string">"/tmp/bannergrab"</span>;
            <span class="org-keyword">fi</span>;
        <span class="org-keyword">fi</span>;
    <span class="org-keyword">done</span>
<span class="org-keyword">done</span>
</pre>
</div>

<p>
A lot more on <a href="http://h.ackack.net/cheatsheets/netcat/">http://h.ackack.net/cheatsheets/netcat/</a>: how to workaround <code>-e
cmd.exe</code> option which disappeared, etc.
</p>
</div>

<div id="outline-container-org4d29b4f" class="outline-3">
<h3 id="org4d29b4f"><span class="section-number-3">11.1</span> Scan only certain ports</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-shell">nc -z -w 1 -v -v 10.10.10.11 20-30,53,80,100-112,443,6000-6050
</pre>
</div>
</div>
</div>

<div id="outline-container-org204afce" class="outline-3">
<h3 id="org204afce"><span class="section-number-3">11.2</span> DNS</h3>
<div class="outline-text-3" id="text-11-2">
<div class="org-src-container">
<pre class="src src-shell">nc -p 53 -w 2 -v -v firewall.yournetwork.com 53
nc -u -p 53 -w 2 -v -v firewall.yournetwork.com 53
</pre>
</div>
</div>
</div>

<div id="outline-container-org45c242d" class="outline-3">
<h3 id="org45c242d"><span class="section-number-3">11.3</span> Spoof source IP address</h3>
<div class="outline-text-3" id="text-11-3">
<p>
<code>-s</code> option to Netcat: does not work under Cygwin&#x2026;
</p>
</div>
</div>
