shell-utils.org
** Socat

Learning socat in terms of netcat: http://jdimpson.livejournal.com/6534.html

- *Remote access server*

  #+begin_src shell
  socat TCP-LISTEN:2323,reuseaddr EXEC:/bin/bash
  #+end_src

- *Data forwarder* (aka simple proxy)

  #+begin_src shell
  socat TCP-L:2323 TCP:localhost:22
  #+end_src

  And of course, you can replace either address with any other socat address
  we've already talked about (UDP, UDP-L), or ones we'll talk about in another
  post (e.g. SSL).

** Packet forger

SendIP

** Lauching attacks via Tor

http://www.oreillynet.com/onlamp/blog/2005/07/launching_attacks_via_tor.html
