shell-utils.html

<div id="outline-container-orgbd4b24b" class="outline-3">
<h3 id="orgbd4b24b"><span class="section-number-3">11.4</span> Socat</h3>
<div class="outline-text-3" id="text-11-4">
<p>
Learning socat in terms of netcat: <a href="http://jdimpson.livejournal.com/6534.html">http://jdimpson.livejournal.com/6534.html</a>
</p>

<ul class="org-ul">
<li><p>
<b>Remote access server</b>
</p>

<div class="org-src-container">
<pre class="src src-shell">  socat TCP-LISTEN:2323,reuseaddr EXEC:/bin/bash
</pre>
</div></li>

<li><p>
<b>Data forwarder</b> (aka simple proxy)
</p>

<div class="org-src-container">
<pre class="src src-shell">  socat TCP-L:2323 TCP:localhost:22
</pre>
</div>

<p>
And of course, you can replace either address with any other socat address
we&rsquo;ve already talked about (UDP, UDP-L), or ones we&rsquo;ll talk about in another
post (e.g. SSL).
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org287820b" class="outline-3">
<h3 id="org287820b"><span class="section-number-3">11.5</span> Packet forger</h3>
<div class="outline-text-3" id="text-11-5">
<p>
SendIP
</p>
</div>
</div>

<div id="outline-container-org4444414" class="outline-3">
<h3 id="org4444414"><span class="section-number-3">11.6</span> Lauching attacks via Tor</h3>
<div class="outline-text-3" id="text-11-6">
<p>
<a href="http://www.oreillynet.com/onlamp/blog/2005/07/launching_attacks_via_tor.html">http://www.oreillynet.com/onlamp/blog/2005/07/launching_attacks_via_tor.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fabrice Niessen</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
